jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_EPCA_A_Registers.h
//------------------------------------------------------------------------------
// Copyright (c) 2012 by Silicon Laboratories. 
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User 
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v10/License_Agreement_v10.htm
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//
// Script: 0.59
// Version: 1

#ifndef __SI32_EPCA_A_REGISTERS_H__
#define __SI32_EPCA_A_REGISTERS_H__

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

struct SI32_EPCA_A_MODE_Struct
{
   union
   {
      struct
      {
         // Input Clock Divider
         volatile uint32_t CLKDIV: 10;
         // Input Clock (F<subscript>CLKIN</subscript>) Select
         volatile uint32_t CLKSEL: 3;
                  uint32_t reserved0: 1;
         // High Drive Port Bank Output Select
         volatile uint32_t HDOSEL: 2;
         // DMA Write End Index
         volatile uint32_t DEND: 3;
         // DMA Write Transfer Pointer
         volatile uint32_t DPTR: 3;
         // DMA Target Start Index
         volatile uint32_t DSTART: 3;
         // DMA Busy Flag
         volatile uint32_t DBUSYF: 1;
                  uint32_t reserved1: 1;
         // Standard Port Bank Output Select
         volatile uint32_t STDOSEL: 2;
                  uint32_t reserved2: 3;
      };
      volatile uint32_t U32;
   };
};

#define SI32_EPCA_A_MODE_CLKDIV_MASK  0x000003FF
#define SI32_EPCA_A_MODE_CLKDIV_SHIFT  0

#define SI32_EPCA_A_MODE_CLKSEL_MASK  0x00001C00
#define SI32_EPCA_A_MODE_CLKSEL_SHIFT  10
// Set the APB as the input clock (FCLKIN).
#define SI32_EPCA_A_MODE_CLKSEL_APB_VALUE  0
#define SI32_EPCA_A_MODE_CLKSEL_APB_U32 \
   (SI32_EPCA_A_MODE_CLKSEL_APB_VALUE << SI32_EPCA_A_MODE_CLKSEL_SHIFT)
// Set Timer 0 low overflows divided by 2 as the input clock (FCLKIN).
#define SI32_EPCA_A_MODE_CLKSEL_TIMER0_VALUE  1
#define SI32_EPCA_A_MODE_CLKSEL_TIMER0_U32 \
   (SI32_EPCA_A_MODE_CLKSEL_TIMER0_VALUE << SI32_EPCA_A_MODE_CLKSEL_SHIFT)
// Set high-to-low transitions on ECI divided by 2 as the input clock (FCLKIN).
#define SI32_EPCA_A_MODE_CLKSEL_HL_ECI_VALUE  2
#define SI32_EPCA_A_MODE_CLKSEL_HL_ECI_U32 \
   (SI32_EPCA_A_MODE_CLKSEL_HL_ECI_VALUE << SI32_EPCA_A_MODE_CLKSEL_SHIFT)
// Set the external oscillator module output (EXTOSCn) divided by 2 as the input
// clock (FCLKIN).
#define SI32_EPCA_A_MODE_CLKSEL_EXTOSCN_VALUE  3
#define SI32_EPCA_A_MODE_CLKSEL_EXTOSCN_U32 \
   (SI32_EPCA_A_MODE_CLKSEL_EXTOSCN_VALUE << SI32_EPCA_A_MODE_CLKSEL_SHIFT)
// Set ECI transitions divided by 2 as the input clock (FCLKIN).
#define SI32_EPCA_A_MODE_CLKSEL_ECI_VALUE  4
#define SI32_EPCA_A_MODE_CLKSEL_ECI_U32 \
   (SI32_EPCA_A_MODE_CLKSEL_ECI_VALUE << SI32_EPCA_A_MODE_CLKSEL_SHIFT)

#define SI32_EPCA_A_MODE_HDOSEL_MASK  0x0000C000
#define SI32_EPCA_A_MODE_HDOSEL_SHIFT  14
// Select three differential outputs from Channels 3, 4, and 5 for the High Drive
// pins.
#define SI32_EPCA_A_MODE_HDOSEL_THREE_DIFF_VALUE  0
#define SI32_EPCA_A_MODE_HDOSEL_THREE_DIFF_U32 \
   (SI32_EPCA_A_MODE_HDOSEL_THREE_DIFF_VALUE << SI32_EPCA_A_MODE_HDOSEL_SHIFT)
// Select the differential outputs from Channels 4 and 5 and non-differential
// outputs from Channels 2 and 3 for the High Drive pins.
#define SI32_EPCA_A_MODE_HDOSEL_TWO_DIFF_VALUE  1
#define SI32_EPCA_A_MODE_HDOSEL_TWO_DIFF_U32 \
   (SI32_EPCA_A_MODE_HDOSEL_TWO_DIFF_VALUE << SI32_EPCA_A_MODE_HDOSEL_SHIFT)
// Select the differential output from Channel 5 and non-differential outputs from
// Channels 1-4 for the High Drive pins.
#define SI32_EPCA_A_MODE_HDOSEL_ONE_DIFF_VALUE  2
#define SI32_EPCA_A_MODE_HDOSEL_ONE_DIFF_U32 \
   (SI32_EPCA_A_MODE_HDOSEL_ONE_DIFF_VALUE << SI32_EPCA_A_MODE_HDOSEL_SHIFT)
// Select the non-differential channel outputs (Channels 0-5) for the High Drive
// pins.
#define SI32_EPCA_A_MODE_HDOSEL_NO_DIFF_VALUE  3
#define SI32_EPCA_A_MODE_HDOSEL_NO_DIFF_U32 \
   (SI32_EPCA_A_MODE_HDOSEL_NO_DIFF_VALUE << SI32_EPCA_A_MODE_HDOSEL_SHIFT)

#define SI32_EPCA_A_MODE_DEND_MASK  0x00070000
#define SI32_EPCA_A_MODE_DEND_SHIFT  16
// Set the last register in a DMA write transfer to LIMITUPD.
#define SI32_EPCA_A_MODE_DEND_LIMIT_VALUE  0
#define SI32_EPCA_A_MODE_DEND_LIMIT_U32 \
   (SI32_EPCA_A_MODE_DEND_LIMIT_VALUE << SI32_EPCA_A_MODE_DEND_SHIFT)
// Set the last register in a DMA write transfer to Channel 0 CCAPVUPD.
#define SI32_EPCA_A_MODE_DEND_CH0_VALUE  1
#define SI32_EPCA_A_MODE_DEND_CH0_U32 \
   (SI32_EPCA_A_MODE_DEND_CH0_VALUE << SI32_EPCA_A_MODE_DEND_SHIFT)
// Set the last register in a DMA write transfer to Channel 1 CCAPVUPD.
#define SI32_EPCA_A_MODE_DEND_CH1_VALUE  2
#define SI32_EPCA_A_MODE_DEND_CH1_U32 \
   (SI32_EPCA_A_MODE_DEND_CH1_VALUE << SI32_EPCA_A_MODE_DEND_SHIFT)
// Set the last register in a DMA write transfer to Channel 2 CCAPVUPD.
#define SI32_EPCA_A_MODE_DEND_CH2_VALUE  3
#define SI32_EPCA_A_MODE_DEND_CH2_U32 \
   (SI32_EPCA_A_MODE_DEND_CH2_VALUE << SI32_EPCA_A_MODE_DEND_SHIFT)
// Set the last register in a DMA write transfer to Channel 3 CCAPVUPD.
#define SI32_EPCA_A_MODE_DEND_CH3_VALUE  4
#define SI32_EPCA_A_MODE_DEND_CH3_U32 \
   (SI32_EPCA_A_MODE_DEND_CH3_VALUE << SI32_EPCA_A_MODE_DEND_SHIFT)
// Set the last register in a DMA write transfer to Channel 4 CCAPVUPD.
#define SI32_EPCA_A_MODE_DEND_CH4_VALUE  5
#define SI32_EPCA_A_MODE_DEND_CH4_U32 \
   (SI32_EPCA_A_MODE_DEND_CH4_VALUE << SI32_EPCA_A_MODE_DEND_SHIFT)
// Set the last register in a DMA write transfer to Channel 5 CCAPVUPD.
#define SI32_EPCA_A_MODE_DEND_CH5_VALUE  6
#define SI32_EPCA_A_MODE_DEND_CH5_U32 \
   (SI32_EPCA_A_MODE_DEND_CH5_VALUE << SI32_EPCA_A_MODE_DEND_SHIFT)
// Empty slot.
#define SI32_EPCA_A_MODE_DEND_EMPTY_VALUE  7
#define SI32_EPCA_A_MODE_DEND_EMPTY_U32 \
   (SI32_EPCA_A_MODE_DEND_EMPTY_VALUE << SI32_EPCA_A_MODE_DEND_SHIFT)

