jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_EPCA_A_Registers.h
#define SI32_EPCA_A_MODE_DPTR_MASK  0x00380000
#define SI32_EPCA_A_MODE_DPTR_SHIFT  19
// The DMA channel will write to LIMITUPD next.
#define SI32_EPCA_A_MODE_DPTR_LIMIT_VALUE  0
#define SI32_EPCA_A_MODE_DPTR_LIMIT_U32 \
   (SI32_EPCA_A_MODE_DPTR_LIMIT_VALUE << SI32_EPCA_A_MODE_DPTR_SHIFT)
// The DMA channel will write to Channel 0 CCAPVUPD next.
#define SI32_EPCA_A_MODE_DPTR_CH0_VALUE  1
#define SI32_EPCA_A_MODE_DPTR_CH0_U32 \
   (SI32_EPCA_A_MODE_DPTR_CH0_VALUE << SI32_EPCA_A_MODE_DPTR_SHIFT)
// The DMA channel will write to Channel 1 CCAPVUPD next.
#define SI32_EPCA_A_MODE_DPTR_CH1_VALUE  2
#define SI32_EPCA_A_MODE_DPTR_CH1_U32 \
   (SI32_EPCA_A_MODE_DPTR_CH1_VALUE << SI32_EPCA_A_MODE_DPTR_SHIFT)
// The DMA channel will write to Channel 2 CCAPVUPD next.
#define SI32_EPCA_A_MODE_DPTR_CH2_VALUE  3
#define SI32_EPCA_A_MODE_DPTR_CH2_U32 \
   (SI32_EPCA_A_MODE_DPTR_CH2_VALUE << SI32_EPCA_A_MODE_DPTR_SHIFT)
// The DMA channel will write to Channel 3 CCAPVUPD next.
#define SI32_EPCA_A_MODE_DPTR_CH3_VALUE  4
#define SI32_EPCA_A_MODE_DPTR_CH3_U32 \
   (SI32_EPCA_A_MODE_DPTR_CH3_VALUE << SI32_EPCA_A_MODE_DPTR_SHIFT)
// The DMA channel will write to Channel 4 CCAPVUPD next.
#define SI32_EPCA_A_MODE_DPTR_CH4_VALUE  5
#define SI32_EPCA_A_MODE_DPTR_CH4_U32 \
   (SI32_EPCA_A_MODE_DPTR_CH4_VALUE << SI32_EPCA_A_MODE_DPTR_SHIFT)
// The DMA channel will write to Channel 5 CCAPVUPD next.
#define SI32_EPCA_A_MODE_DPTR_CH5_VALUE  6
#define SI32_EPCA_A_MODE_DPTR_CH5_U32 \
   (SI32_EPCA_A_MODE_DPTR_CH5_VALUE << SI32_EPCA_A_MODE_DPTR_SHIFT)
// Empty slot.
#define SI32_EPCA_A_MODE_DPTR_EMPTY_VALUE  7
#define SI32_EPCA_A_MODE_DPTR_EMPTY_U32 \
   (SI32_EPCA_A_MODE_DPTR_EMPTY_VALUE << SI32_EPCA_A_MODE_DPTR_SHIFT)

#define SI32_EPCA_A_MODE_DSTART_MASK  0x01C00000
#define SI32_EPCA_A_MODE_DSTART_SHIFT  22
// Set the first register in a DMA write transfer to LIMITUPD.
#define SI32_EPCA_A_MODE_DSTART_LIMIT_VALUE  0
#define SI32_EPCA_A_MODE_DSTART_LIMIT_U32 \
   (SI32_EPCA_A_MODE_DSTART_LIMIT_VALUE << SI32_EPCA_A_MODE_DSTART_SHIFT)
// Set the first register in a DMA write transfer to Channel 0 CCAPVUPD.
#define SI32_EPCA_A_MODE_DSTART_CH0_VALUE  1
#define SI32_EPCA_A_MODE_DSTART_CH0_U32 \
   (SI32_EPCA_A_MODE_DSTART_CH0_VALUE << SI32_EPCA_A_MODE_DSTART_SHIFT)
// Set the first register in a DMA write transfer to Channel 1 CCAPVUPD.
#define SI32_EPCA_A_MODE_DSTART_CH1_VALUE  2
#define SI32_EPCA_A_MODE_DSTART_CH1_U32 \
   (SI32_EPCA_A_MODE_DSTART_CH1_VALUE << SI32_EPCA_A_MODE_DSTART_SHIFT)
// Set the first register in a DMA write transfer to Channel 2 CCAPVUPD.
#define SI32_EPCA_A_MODE_DSTART_CH2_VALUE  3
#define SI32_EPCA_A_MODE_DSTART_CH2_U32 \
   (SI32_EPCA_A_MODE_DSTART_CH2_VALUE << SI32_EPCA_A_MODE_DSTART_SHIFT)
// Set the first register in a DMA write transfer to Channel 3 CCAPVUPD.
#define SI32_EPCA_A_MODE_DSTART_CH3_VALUE  4
#define SI32_EPCA_A_MODE_DSTART_CH3_U32 \
   (SI32_EPCA_A_MODE_DSTART_CH3_VALUE << SI32_EPCA_A_MODE_DSTART_SHIFT)
// Set the first register in a DMA write transfer to Channel 4 CCAPVUPD.
#define SI32_EPCA_A_MODE_DSTART_CH4_VALUE  5
#define SI32_EPCA_A_MODE_DSTART_CH4_U32 \
   (SI32_EPCA_A_MODE_DSTART_CH4_VALUE << SI32_EPCA_A_MODE_DSTART_SHIFT)
// Set the first register in a DMA write transfer to Channel 5 CCAPVUPD.
#define SI32_EPCA_A_MODE_DSTART_CH5_VALUE  6
#define SI32_EPCA_A_MODE_DSTART_CH5_U32 \
   (SI32_EPCA_A_MODE_DSTART_CH5_VALUE << SI32_EPCA_A_MODE_DSTART_SHIFT)
// Empty slot.
#define SI32_EPCA_A_MODE_DSTART_EMPTY_VALUE  7
#define SI32_EPCA_A_MODE_DSTART_EMPTY_U32 \
   (SI32_EPCA_A_MODE_DSTART_EMPTY_VALUE << SI32_EPCA_A_MODE_DSTART_SHIFT)

#define SI32_EPCA_A_MODE_DBUSYF_MASK  0x02000000
#define SI32_EPCA_A_MODE_DBUSYF_SHIFT  25
// The DMA channel is not servicing an EPCA control transfer.
#define SI32_EPCA_A_MODE_DBUSYF_IDLE_VALUE  0
#define SI32_EPCA_A_MODE_DBUSYF_IDLE_U32 \
   (SI32_EPCA_A_MODE_DBUSYF_IDLE_VALUE << SI32_EPCA_A_MODE_DBUSYF_SHIFT)
// The DMA channel is busy servicing an EPCA control transfer.
#define SI32_EPCA_A_MODE_DBUSYF_BUSY_VALUE  1
#define SI32_EPCA_A_MODE_DBUSYF_BUSY_U32 \
   (SI32_EPCA_A_MODE_DBUSYF_BUSY_VALUE << SI32_EPCA_A_MODE_DBUSYF_SHIFT)

#define SI32_EPCA_A_MODE_STDOSEL_MASK  0x18000000
#define SI32_EPCA_A_MODE_STDOSEL_SHIFT  27
// Select the non-differential channel outputs (Channels 0-5) for the standard PB
// pins.
#define SI32_EPCA_A_MODE_STDOSEL_NO_DIFF_VALUE  0
#define SI32_EPCA_A_MODE_STDOSEL_NO_DIFF_U32 \
   (SI32_EPCA_A_MODE_STDOSEL_NO_DIFF_VALUE << SI32_EPCA_A_MODE_STDOSEL_SHIFT)
// Select the differential output from Channel 2 and non-differential outputs from
// Channels 0, 1, 3, and 4 for the standard PB pins.
#define SI32_EPCA_A_MODE_STDOSEL_ONE_DIFF_VALUE  1
#define SI32_EPCA_A_MODE_STDOSEL_ONE_DIFF_U32 \
   (SI32_EPCA_A_MODE_STDOSEL_ONE_DIFF_VALUE << SI32_EPCA_A_MODE_STDOSEL_SHIFT)
// Select the differential outputs from Channels 1 and 2 and non-differential
// outputs from Channels 0 and 3 for the standard PB pins.
#define SI32_EPCA_A_MODE_STDOSEL_TWO_DIFF_VALUE  2
#define SI32_EPCA_A_MODE_STDOSEL_TWO_DIFF_U32 \
   (SI32_EPCA_A_MODE_STDOSEL_TWO_DIFF_VALUE << SI32_EPCA_A_MODE_STDOSEL_SHIFT)
// Select three differential outputs from Channels 0, 1, and 2 for the standard PB
// pins.
#define SI32_EPCA_A_MODE_STDOSEL_THREE_DIFF_VALUE  3
#define SI32_EPCA_A_MODE_STDOSEL_THREE_DIFF_U32 \
   (SI32_EPCA_A_MODE_STDOSEL_THREE_DIFF_VALUE << SI32_EPCA_A_MODE_STDOSEL_SHIFT)



struct SI32_EPCA_A_CONTROL_Struct
{
   union
   {
      struct
      {
         // EPCA Counter Overflow/Limit Interrupt Enable
         volatile uint32_t OVFIEN: 1;
         // EPCA Counter Overflow/Limit DMA Request Enable
         volatile uint32_t OVFDEN: 1;
         // EPCA Counter Overflow/Limit Synchronization Signal Enable
         volatile uint32_t OVFSEN: 1;
         // EPCA Halt Input Interrupt Enable
         volatile uint32_t HALTIEN: 1;
         // Internal Register Update Inhibit
         volatile uint32_t NOUPD: 1;
         // Idle Bypass Enable
         volatile uint32_t IDLEBEN: 1;
         // EPCA Debug Mode
         volatile uint32_t DBGMD: 1;
                  uint32_t reserved0: 2;
         // Halt Input Enable
         volatile uint32_t HALTEN: 1;
                  uint32_t reserved1: 1;
         // Synchronous Input Trigger Select
         volatile uint32_t STSEL: 2;
         // Synchronous Input Trigger Edge Select
         volatile uint32_t STESEL: 1;
         // Synchronous Input Trigger Enable
         volatile uint32_t STEN: 1;
                  uint32_t reserved2: 6;
         // Clock Divider Output State
         volatile uint32_t DIVST: 1;
         // Current Clock Divider Count
         volatile uint32_t DIV: 10;
      };
      volatile uint32_t U32;
   };
};

