jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_EPCA_A_Registers.h
#define SI32_EPCA_A_CONTROL_OVFIEN_MASK  0x00000001
#define SI32_EPCA_A_CONTROL_OVFIEN_SHIFT  0
// Disable the EPCA counter overflow/limit event interrupt.
#define SI32_EPCA_A_CONTROL_OVFIEN_DISABLED_VALUE  0
#define SI32_EPCA_A_CONTROL_OVFIEN_DISABLED_U32 \
   (SI32_EPCA_A_CONTROL_OVFIEN_DISABLED_VALUE << SI32_EPCA_A_CONTROL_OVFIEN_SHIFT)
// Enable the EPCA counter overflow/limit event interrupt.
#define SI32_EPCA_A_CONTROL_OVFIEN_ENABLED_VALUE  1
#define SI32_EPCA_A_CONTROL_OVFIEN_ENABLED_U32 \
   (SI32_EPCA_A_CONTROL_OVFIEN_ENABLED_VALUE << SI32_EPCA_A_CONTROL_OVFIEN_SHIFT)

#define SI32_EPCA_A_CONTROL_OVFDEN_MASK  0x00000002
#define SI32_EPCA_A_CONTROL_OVFDEN_SHIFT  1
// Do not request DMA data when a EPCA counter overflow/limit event occurs.
#define SI32_EPCA_A_CONTROL_OVFDEN_DISABLED_VALUE  0
#define SI32_EPCA_A_CONTROL_OVFDEN_DISABLED_U32 \
   (SI32_EPCA_A_CONTROL_OVFDEN_DISABLED_VALUE << SI32_EPCA_A_CONTROL_OVFDEN_SHIFT)
// Request DMA data when a EPCA counter overflow/limit event occurs.
#define SI32_EPCA_A_CONTROL_OVFDEN_ENABLED_VALUE  1
#define SI32_EPCA_A_CONTROL_OVFDEN_ENABLED_U32 \
   (SI32_EPCA_A_CONTROL_OVFDEN_ENABLED_VALUE << SI32_EPCA_A_CONTROL_OVFDEN_SHIFT)

#define SI32_EPCA_A_CONTROL_OVFSEN_MASK  0x00000004
#define SI32_EPCA_A_CONTROL_OVFSEN_SHIFT  2
// Do not send a synchronization signal when a EPCA counter overflow/limit event
// occurs.
#define SI32_EPCA_A_CONTROL_OVFSEN_DISABLED_VALUE  0
#define SI32_EPCA_A_CONTROL_OVFSEN_DISABLED_U32 \
   (SI32_EPCA_A_CONTROL_OVFSEN_DISABLED_VALUE << SI32_EPCA_A_CONTROL_OVFSEN_SHIFT)
// Send a synchronization signal when a EPCA counter overflow/limit event occurs.
#define SI32_EPCA_A_CONTROL_OVFSEN_ENABLED_VALUE  1
#define SI32_EPCA_A_CONTROL_OVFSEN_ENABLED_U32 \
   (SI32_EPCA_A_CONTROL_OVFSEN_ENABLED_VALUE << SI32_EPCA_A_CONTROL_OVFSEN_SHIFT)

#define SI32_EPCA_A_CONTROL_HALTIEN_MASK  0x00000008
#define SI32_EPCA_A_CONTROL_HALTIEN_SHIFT  3
// Do not generate an interrupt if the EPCA halt input is high.
#define SI32_EPCA_A_CONTROL_HALTIEN_DISABLED_VALUE  0
#define SI32_EPCA_A_CONTROL_HALTIEN_DISABLED_U32 \
   (SI32_EPCA_A_CONTROL_HALTIEN_DISABLED_VALUE << SI32_EPCA_A_CONTROL_HALTIEN_SHIFT)
// Generate an interrupt if the EPCA halt input is high.
#define SI32_EPCA_A_CONTROL_HALTIEN_ENABLED_VALUE  1
#define SI32_EPCA_A_CONTROL_HALTIEN_ENABLED_U32 \
   (SI32_EPCA_A_CONTROL_HALTIEN_ENABLED_VALUE << SI32_EPCA_A_CONTROL_HALTIEN_SHIFT)

#define SI32_EPCA_A_CONTROL_NOUPD_MASK  0x00000010
#define SI32_EPCA_A_CONTROL_NOUPD_SHIFT  4
// The EPCA registers will automatically load any new update values after an
// overflow/limit event occurs.
#define SI32_EPCA_A_CONTROL_NOUPD_INACTIVE_VALUE  0
#define SI32_EPCA_A_CONTROL_NOUPD_INACTIVE_U32 \
   (SI32_EPCA_A_CONTROL_NOUPD_INACTIVE_VALUE << SI32_EPCA_A_CONTROL_NOUPD_SHIFT)
// The EPCA registers will not load any new update values after an overflow/limit
// event occurs.
#define SI32_EPCA_A_CONTROL_NOUPD_ACTIVE_VALUE  1
#define SI32_EPCA_A_CONTROL_NOUPD_ACTIVE_U32 \
   (SI32_EPCA_A_CONTROL_NOUPD_ACTIVE_VALUE << SI32_EPCA_A_CONTROL_NOUPD_SHIFT)

#define SI32_EPCA_A_CONTROL_IDLEBEN_MASK  0x00000020
#define SI32_EPCA_A_CONTROL_IDLEBEN_SHIFT  5
// The EPCA module will stop running when the core halts (idle).
#define SI32_EPCA_A_CONTROL_IDLEBEN_DISABLED_VALUE  0
#define SI32_EPCA_A_CONTROL_IDLEBEN_DISABLED_U32 \
   (SI32_EPCA_A_CONTROL_IDLEBEN_DISABLED_VALUE << SI32_EPCA_A_CONTROL_IDLEBEN_SHIFT)
// The EPCA module will continue normal operation when the core halts (idle).
#define SI32_EPCA_A_CONTROL_IDLEBEN_ENABLED_VALUE  1
#define SI32_EPCA_A_CONTROL_IDLEBEN_ENABLED_U32 \
   (SI32_EPCA_A_CONTROL_IDLEBEN_ENABLED_VALUE << SI32_EPCA_A_CONTROL_IDLEBEN_SHIFT)

#define SI32_EPCA_A_CONTROL_DBGMD_MASK  0x00000040
#define SI32_EPCA_A_CONTROL_DBGMD_SHIFT  6
// A debug breakpoint will stop the EPCA counter/timer.
#define SI32_EPCA_A_CONTROL_DBGMD_HALT_VALUE  0
#define SI32_EPCA_A_CONTROL_DBGMD_HALT_U32 \
   (SI32_EPCA_A_CONTROL_DBGMD_HALT_VALUE << SI32_EPCA_A_CONTROL_DBGMD_SHIFT)
// The EPCA will continue to operate while the core is halted in debug mode.
#define SI32_EPCA_A_CONTROL_DBGMD_RUN_VALUE  1
#define SI32_EPCA_A_CONTROL_DBGMD_RUN_U32 \
   (SI32_EPCA_A_CONTROL_DBGMD_RUN_VALUE << SI32_EPCA_A_CONTROL_DBGMD_SHIFT)

#define SI32_EPCA_A_CONTROL_HALTEN_MASK  0x00000200
#define SI32_EPCA_A_CONTROL_HALTEN_SHIFT  9
// The Halt input (PB_HDKill) does not affect the EPCA counter/timer.
#define SI32_EPCA_A_CONTROL_HALTEN_DISABLED_VALUE  0
#define SI32_EPCA_A_CONTROL_HALTEN_DISABLED_U32 \
   (SI32_EPCA_A_CONTROL_HALTEN_DISABLED_VALUE << SI32_EPCA_A_CONTROL_HALTEN_SHIFT)
// An assertion of the Halt input (PB_HDKill) will stop the EPCA counter/timer.
#define SI32_EPCA_A_CONTROL_HALTEN_ENABLED_VALUE  1
#define SI32_EPCA_A_CONTROL_HALTEN_ENABLED_U32 \
   (SI32_EPCA_A_CONTROL_HALTEN_ENABLED_VALUE << SI32_EPCA_A_CONTROL_HALTEN_SHIFT)

#define SI32_EPCA_A_CONTROL_STSEL_MASK  0x00001800
#define SI32_EPCA_A_CONTROL_STSEL_SHIFT  11
// Select input trigger 0, EPCAnT0.
#define SI32_EPCA_A_CONTROL_STSEL_EPCANT0_VALUE  0
#define SI32_EPCA_A_CONTROL_STSEL_EPCANT0_U32 \
   (SI32_EPCA_A_CONTROL_STSEL_EPCANT0_VALUE << SI32_EPCA_A_CONTROL_STSEL_SHIFT)
// Select input trigger 1, EPCAnT1.
#define SI32_EPCA_A_CONTROL_STSEL_EPCANT1_VALUE  1
#define SI32_EPCA_A_CONTROL_STSEL_EPCANT1_U32 \
   (SI32_EPCA_A_CONTROL_STSEL_EPCANT1_VALUE << SI32_EPCA_A_CONTROL_STSEL_SHIFT)
// Select input trigger 2,  EPCAnT2.
#define SI32_EPCA_A_CONTROL_STSEL_EPCANT2_VALUE  2
#define SI32_EPCA_A_CONTROL_STSEL_EPCANT2_U32 \
   (SI32_EPCA_A_CONTROL_STSEL_EPCANT2_VALUE << SI32_EPCA_A_CONTROL_STSEL_SHIFT)
// Select input trigger 3, EPCAnT3.
#define SI32_EPCA_A_CONTROL_STSEL_EPCANT3_VALUE  3
#define SI32_EPCA_A_CONTROL_STSEL_EPCANT3_U32 \
   (SI32_EPCA_A_CONTROL_STSEL_EPCANT3_VALUE << SI32_EPCA_A_CONTROL_STSEL_SHIFT)

#define SI32_EPCA_A_CONTROL_STESEL_MASK  0x00002000
#define SI32_EPCA_A_CONTROL_STESEL_SHIFT  13
// A high-to-low transition (falling edge) on EPCAnTx will start the counter/timer.
#define SI32_EPCA_A_CONTROL_STESEL_FALLING_VALUE  0
#define SI32_EPCA_A_CONTROL_STESEL_FALLING_U32 \
   (SI32_EPCA_A_CONTROL_STESEL_FALLING_VALUE << SI32_EPCA_A_CONTROL_STESEL_SHIFT)
// A low-to-high transition (rising edge) on EPCAnTx will start the counter/timer.
#define SI32_EPCA_A_CONTROL_STESEL_RISING_VALUE  1
#define SI32_EPCA_A_CONTROL_STESEL_RISING_U32 \
   (SI32_EPCA_A_CONTROL_STESEL_RISING_VALUE << SI32_EPCA_A_CONTROL_STESEL_SHIFT)

#define SI32_EPCA_A_CONTROL_STEN_MASK  0x00004000
#define SI32_EPCA_A_CONTROL_STEN_SHIFT  14
// Disable the input trigger (EPCAnTx). The EPCA counter/timer will continue to run
// if the RUN bit is set regardless of the value on the input trigger.
#define SI32_EPCA_A_CONTROL_STEN_DISABLED_VALUE  0
#define SI32_EPCA_A_CONTROL_STEN_DISABLED_U32 \
   (SI32_EPCA_A_CONTROL_STEN_DISABLED_VALUE << SI32_EPCA_A_CONTROL_STEN_SHIFT)
// Enable the input trigger (EPCAnTx). If RUN is set to 1, the EPCA counter/timer
// will start running when the selected input trigger (STSEL) meets the criteria
// set by STESEL. It will not stop running if the criteria is no longer met.
#define SI32_EPCA_A_CONTROL_STEN_ENABLED_VALUE  1
#define SI32_EPCA_A_CONTROL_STEN_ENABLED_U32 \
   (SI32_EPCA_A_CONTROL_STEN_ENABLED_VALUE << SI32_EPCA_A_CONTROL_STEN_SHIFT)

#define SI32_EPCA_A_CONTROL_DIVST_MASK  0x00200000
#define SI32_EPCA_A_CONTROL_DIVST_SHIFT  21
// The clock divider is currently in the first half-cycle.
#define SI32_EPCA_A_CONTROL_DIVST_OUTPUT_HIGH_VALUE  0
#define SI32_EPCA_A_CONTROL_DIVST_OUTPUT_HIGH_U32 \
   (SI32_EPCA_A_CONTROL_DIVST_OUTPUT_HIGH_VALUE << SI32_EPCA_A_CONTROL_DIVST_SHIFT)
// The clock divider is currently in the second half-cycle.
#define SI32_EPCA_A_CONTROL_DIVST_OUTPUT_LOW_VALUE  1
#define SI32_EPCA_A_CONTROL_DIVST_OUTPUT_LOW_U32 \
   (SI32_EPCA_A_CONTROL_DIVST_OUTPUT_LOW_VALUE << SI32_EPCA_A_CONTROL_DIVST_SHIFT)

#define SI32_EPCA_A_CONTROL_DIV_MASK  0xFFC00000
#define SI32_EPCA_A_CONTROL_DIV_SHIFT  22



struct SI32_EPCA_A_STATUS_Struct
{
   union
   {
      struct
      {
         // Channel 0 Capture/Compare Interrupt Flag
         volatile uint32_t C0CCI: 1;
         // Channel 1 Capture/Compare Interrupt Flag
         volatile uint32_t C1CCI: 1;
         // Channel 2 Capture/Compare Interrupt Flag
         volatile uint32_t C2CCI: 1;
         // Channel 3 Capture/Compare Interrupt Flag
         volatile uint32_t C3CCI: 1;
         // Channel 4 Capture/Compare Interrupt Flag
         volatile uint32_t C4CCI: 1;
         // Channel 5 Capture/Compare Interrupt Flag
         volatile uint32_t C5CCI: 1;
         // Counter/Timer Run
         volatile uint32_t RUN: 1;
         // Counter/Timer Overflow/Limit Interrupt Flag
         volatile uint32_t OVFI: 1;
         // Register Update Complete Flag
         volatile uint32_t UPDCF: 1;
         // Halt Input Interrupt Flag
         volatile uint32_t HALTI: 1;
         // Channel 0 Intermediate Overflow Interrupt Flag
         volatile uint32_t C0IOVFI: 1;
         // Channel 1 Intermediate Overflow Interrupt Flag
         volatile uint32_t C1IOVFI: 1;
         // Channel 2 Intermediate Overflow Interrupt Flag
         volatile uint32_t C2IOVFI: 1;
         // Channel 3 Intermediate Overflow Interrupt Flag
         volatile uint32_t C3IOVFI: 1;
         // Channel 4 Intermediate Overflow Interrupt Flag
         volatile uint32_t C4IOVFI: 1;
         // Channel 5 Intermediate Overflow Interrupt Flag
         volatile uint32_t C5IOVFI: 1;
                  uint32_t reserved0: 16;
      };
      volatile uint32_t U32;
   };
};

#define SI32_EPCA_A_STATUS_C0CCI_MASK  0x00000001
#define SI32_EPCA_A_STATUS_C0CCI_SHIFT  0
// A Channel 0 match or capture event did not occur.
#define SI32_EPCA_A_STATUS_C0CCI_NOT_SET_VALUE  0
#define SI32_EPCA_A_STATUS_C0CCI_NOT_SET_U32 \
   (SI32_EPCA_A_STATUS_C0CCI_NOT_SET_VALUE << SI32_EPCA_A_STATUS_C0CCI_SHIFT)
// A Channel 0 match or capture event occurred.
#define SI32_EPCA_A_STATUS_C0CCI_SET_VALUE  1
#define SI32_EPCA_A_STATUS_C0CCI_SET_U32 \
   (SI32_EPCA_A_STATUS_C0CCI_SET_VALUE << SI32_EPCA_A_STATUS_C0CCI_SHIFT)

#define SI32_EPCA_A_STATUS_C1CCI_MASK  0x00000002
#define SI32_EPCA_A_STATUS_C1CCI_SHIFT  1
// A Channel 1 match or capture event did not occur.
#define SI32_EPCA_A_STATUS_C1CCI_NOT_SET_VALUE  0
#define SI32_EPCA_A_STATUS_C1CCI_NOT_SET_U32 \
   (SI32_EPCA_A_STATUS_C1CCI_NOT_SET_VALUE << SI32_EPCA_A_STATUS_C1CCI_SHIFT)
// A Channel 1 match or capture event occurred.
#define SI32_EPCA_A_STATUS_C1CCI_SET_VALUE  1
#define SI32_EPCA_A_STATUS_C1CCI_SET_U32 \
   (SI32_EPCA_A_STATUS_C1CCI_SET_VALUE << SI32_EPCA_A_STATUS_C1CCI_SHIFT)

#define SI32_EPCA_A_STATUS_C2CCI_MASK  0x00000004
#define SI32_EPCA_A_STATUS_C2CCI_SHIFT  2
// A Channel 2 match or capture event did not occur.
#define SI32_EPCA_A_STATUS_C2CCI_NOT_SET_VALUE  0
#define SI32_EPCA_A_STATUS_C2CCI_NOT_SET_U32 \
   (SI32_EPCA_A_STATUS_C2CCI_NOT_SET_VALUE << SI32_EPCA_A_STATUS_C2CCI_SHIFT)
// A Channel 2 match or capture event occurred.
#define SI32_EPCA_A_STATUS_C2CCI_SET_VALUE  1
#define SI32_EPCA_A_STATUS_C2CCI_SET_U32 \
   (SI32_EPCA_A_STATUS_C2CCI_SET_VALUE << SI32_EPCA_A_STATUS_C2CCI_SHIFT)

#define SI32_EPCA_A_STATUS_C3CCI_MASK  0x00000008
#define SI32_EPCA_A_STATUS_C3CCI_SHIFT  3
// A Channel 3 match or capture event did not occur.
#define SI32_EPCA_A_STATUS_C3CCI_NOT_SET_VALUE  0
#define SI32_EPCA_A_STATUS_C3CCI_NOT_SET_U32 \
   (SI32_EPCA_A_STATUS_C3CCI_NOT_SET_VALUE << SI32_EPCA_A_STATUS_C3CCI_SHIFT)
// A Channel 3 match or capture event occurred.
#define SI32_EPCA_A_STATUS_C3CCI_SET_VALUE  1
#define SI32_EPCA_A_STATUS_C3CCI_SET_U32 \
   (SI32_EPCA_A_STATUS_C3CCI_SET_VALUE << SI32_EPCA_A_STATUS_C3CCI_SHIFT)

#define SI32_EPCA_A_STATUS_C4CCI_MASK  0x00000010
#define SI32_EPCA_A_STATUS_C4CCI_SHIFT  4
// A Channel 4 match or capture event did not occur.
#define SI32_EPCA_A_STATUS_C4CCI_NOT_SET_VALUE  0
#define SI32_EPCA_A_STATUS_C4CCI_NOT_SET_U32 \
   (SI32_EPCA_A_STATUS_C4CCI_NOT_SET_VALUE << SI32_EPCA_A_STATUS_C4CCI_SHIFT)
// A Channel 4 match or capture event occurred.
#define SI32_EPCA_A_STATUS_C4CCI_SET_VALUE  1
#define SI32_EPCA_A_STATUS_C4CCI_SET_U32 \
   (SI32_EPCA_A_STATUS_C4CCI_SET_VALUE << SI32_EPCA_A_STATUS_C4CCI_SHIFT)

