jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_EPCA_A_Registers.h
#define SI32_EPCA_A_STATUS_C5CCI_MASK  0x00000020
#define SI32_EPCA_A_STATUS_C5CCI_SHIFT  5
// A Channel 5 match or capture event did not occur.
#define SI32_EPCA_A_STATUS_C5CCI_NOT_SET_VALUE  0
#define SI32_EPCA_A_STATUS_C5CCI_NOT_SET_U32 \
   (SI32_EPCA_A_STATUS_C5CCI_NOT_SET_VALUE << SI32_EPCA_A_STATUS_C5CCI_SHIFT)
// A Channel 5 match or capture event occurred.
#define SI32_EPCA_A_STATUS_C5CCI_SET_VALUE  1
#define SI32_EPCA_A_STATUS_C5CCI_SET_U32 \
   (SI32_EPCA_A_STATUS_C5CCI_SET_VALUE << SI32_EPCA_A_STATUS_C5CCI_SHIFT)

#define SI32_EPCA_A_STATUS_RUN_MASK  0x00000040
#define SI32_EPCA_A_STATUS_RUN_SHIFT  6
// Stop the EPCA Counter/Timer.
#define SI32_EPCA_A_STATUS_RUN_STOP_VALUE  0
#define SI32_EPCA_A_STATUS_RUN_STOP_U32 \
   (SI32_EPCA_A_STATUS_RUN_STOP_VALUE << SI32_EPCA_A_STATUS_RUN_SHIFT)
// Start the EPCA Counter/Timer.
#define SI32_EPCA_A_STATUS_RUN_START_VALUE  1
#define SI32_EPCA_A_STATUS_RUN_START_U32 \
   (SI32_EPCA_A_STATUS_RUN_START_VALUE << SI32_EPCA_A_STATUS_RUN_SHIFT)

#define SI32_EPCA_A_STATUS_OVFI_MASK  0x00000080
#define SI32_EPCA_A_STATUS_OVFI_SHIFT  7
// An EPCA Counter/Timer overflow/limit event did not occur.
#define SI32_EPCA_A_STATUS_OVFI_NOT_SET_VALUE  0
#define SI32_EPCA_A_STATUS_OVFI_NOT_SET_U32 \
   (SI32_EPCA_A_STATUS_OVFI_NOT_SET_VALUE << SI32_EPCA_A_STATUS_OVFI_SHIFT)
// An EPCA Counter/Timer overflow/limit event occurred.
#define SI32_EPCA_A_STATUS_OVFI_SET_VALUE  1
#define SI32_EPCA_A_STATUS_OVFI_SET_U32 \
   (SI32_EPCA_A_STATUS_OVFI_SET_VALUE << SI32_EPCA_A_STATUS_OVFI_SHIFT)

#define SI32_EPCA_A_STATUS_UPDCF_MASK  0x00000100
#define SI32_EPCA_A_STATUS_UPDCF_SHIFT  8
// An EPCA register update completed or is not pending.
#define SI32_EPCA_A_STATUS_UPDCF_EMPTY_VALUE  0
#define SI32_EPCA_A_STATUS_UPDCF_EMPTY_U32 \
   (SI32_EPCA_A_STATUS_UPDCF_EMPTY_VALUE << SI32_EPCA_A_STATUS_UPDCF_SHIFT)
// An EPCA register update has not completed and is still pending.
#define SI32_EPCA_A_STATUS_UPDCF_FULL_VALUE  1
#define SI32_EPCA_A_STATUS_UPDCF_FULL_U32 \
   (SI32_EPCA_A_STATUS_UPDCF_FULL_VALUE << SI32_EPCA_A_STATUS_UPDCF_SHIFT)

#define SI32_EPCA_A_STATUS_HALTI_MASK  0x00000200
#define SI32_EPCA_A_STATUS_HALTI_SHIFT  9
// The Halt input (PB_HDKill) was not asserted.
#define SI32_EPCA_A_STATUS_HALTI_NOT_SET_VALUE  0
#define SI32_EPCA_A_STATUS_HALTI_NOT_SET_U32 \
   (SI32_EPCA_A_STATUS_HALTI_NOT_SET_VALUE << SI32_EPCA_A_STATUS_HALTI_SHIFT)
// The Halt input (PB_HDKill) was asserted.
#define SI32_EPCA_A_STATUS_HALTI_SET_VALUE  1
#define SI32_EPCA_A_STATUS_HALTI_SET_U32 \
   (SI32_EPCA_A_STATUS_HALTI_SET_VALUE << SI32_EPCA_A_STATUS_HALTI_SHIFT)

#define SI32_EPCA_A_STATUS_C0IOVFI_MASK  0x00000400
#define SI32_EPCA_A_STATUS_C0IOVFI_SHIFT  10
// Channel 0 did not count past the channel n-bit mode limit.
#define SI32_EPCA_A_STATUS_C0IOVFI_NOT_SET_VALUE  0
#define SI32_EPCA_A_STATUS_C0IOVFI_NOT_SET_U32 \
   (SI32_EPCA_A_STATUS_C0IOVFI_NOT_SET_VALUE << SI32_EPCA_A_STATUS_C0IOVFI_SHIFT)
// Channel 0 counted past the channel n-bit mode limit.
#define SI32_EPCA_A_STATUS_C0IOVFI_SET_VALUE  1
#define SI32_EPCA_A_STATUS_C0IOVFI_SET_U32 \
   (SI32_EPCA_A_STATUS_C0IOVFI_SET_VALUE << SI32_EPCA_A_STATUS_C0IOVFI_SHIFT)

#define SI32_EPCA_A_STATUS_C1IOVFI_MASK  0x00000800
#define SI32_EPCA_A_STATUS_C1IOVFI_SHIFT  11
// Channel 1 did not count past the channel n-bit mode limit.
#define SI32_EPCA_A_STATUS_C1IOVFI_NOT_SET_VALUE  0
#define SI32_EPCA_A_STATUS_C1IOVFI_NOT_SET_U32 \
   (SI32_EPCA_A_STATUS_C1IOVFI_NOT_SET_VALUE << SI32_EPCA_A_STATUS_C1IOVFI_SHIFT)
// Channel 1 counted past the channel n-bit mode limit.
#define SI32_EPCA_A_STATUS_C1IOVFI_SET_VALUE  1
#define SI32_EPCA_A_STATUS_C1IOVFI_SET_U32 \
   (SI32_EPCA_A_STATUS_C1IOVFI_SET_VALUE << SI32_EPCA_A_STATUS_C1IOVFI_SHIFT)

#define SI32_EPCA_A_STATUS_C2IOVFI_MASK  0x00001000
#define SI32_EPCA_A_STATUS_C2IOVFI_SHIFT  12
// Channel 2 did not count past the channel n-bit mode limit.
#define SI32_EPCA_A_STATUS_C2IOVFI_NOT_SET_VALUE  0
#define SI32_EPCA_A_STATUS_C2IOVFI_NOT_SET_U32 \
   (SI32_EPCA_A_STATUS_C2IOVFI_NOT_SET_VALUE << SI32_EPCA_A_STATUS_C2IOVFI_SHIFT)
// Channel 2 counted past the channel n-bit mode limit.
#define SI32_EPCA_A_STATUS_C2IOVFI_SET_VALUE  1
#define SI32_EPCA_A_STATUS_C2IOVFI_SET_U32 \
   (SI32_EPCA_A_STATUS_C2IOVFI_SET_VALUE << SI32_EPCA_A_STATUS_C2IOVFI_SHIFT)

#define SI32_EPCA_A_STATUS_C3IOVFI_MASK  0x00002000
#define SI32_EPCA_A_STATUS_C3IOVFI_SHIFT  13
// Channel 3 did not count past the channel n-bit mode limit.
#define SI32_EPCA_A_STATUS_C3IOVFI_NOT_SET_VALUE  0
#define SI32_EPCA_A_STATUS_C3IOVFI_NOT_SET_U32 \
   (SI32_EPCA_A_STATUS_C3IOVFI_NOT_SET_VALUE << SI32_EPCA_A_STATUS_C3IOVFI_SHIFT)
// Channel 3 counted past the channel n-bit mode limit.
#define SI32_EPCA_A_STATUS_C3IOVFI_SET_VALUE  1
#define SI32_EPCA_A_STATUS_C3IOVFI_SET_U32 \
   (SI32_EPCA_A_STATUS_C3IOVFI_SET_VALUE << SI32_EPCA_A_STATUS_C3IOVFI_SHIFT)

#define SI32_EPCA_A_STATUS_C4IOVFI_MASK  0x00004000
#define SI32_EPCA_A_STATUS_C4IOVFI_SHIFT  14
// Channel 4 did not count past the channel n-bit mode limit.
#define SI32_EPCA_A_STATUS_C4IOVFI_NOT_SET_VALUE  0
#define SI32_EPCA_A_STATUS_C4IOVFI_NOT_SET_U32 \
   (SI32_EPCA_A_STATUS_C4IOVFI_NOT_SET_VALUE << SI32_EPCA_A_STATUS_C4IOVFI_SHIFT)
// Channel 4 counted past the channel n-bit mode limit.
#define SI32_EPCA_A_STATUS_C4IOVFI_SET_VALUE  1
#define SI32_EPCA_A_STATUS_C4IOVFI_SET_U32 \
   (SI32_EPCA_A_STATUS_C4IOVFI_SET_VALUE << SI32_EPCA_A_STATUS_C4IOVFI_SHIFT)

#define SI32_EPCA_A_STATUS_C5IOVFI_MASK  0x00008000
#define SI32_EPCA_A_STATUS_C5IOVFI_SHIFT  15
// Channel 5 did not count past the channel n-bit mode limit.
#define SI32_EPCA_A_STATUS_C5IOVFI_NOT_SET_VALUE  0
#define SI32_EPCA_A_STATUS_C5IOVFI_NOT_SET_U32 \
   (SI32_EPCA_A_STATUS_C5IOVFI_NOT_SET_VALUE << SI32_EPCA_A_STATUS_C5IOVFI_SHIFT)
// Channel 5 counted past the channel n-bit mode limit.
#define SI32_EPCA_A_STATUS_C5IOVFI_SET_VALUE  1
#define SI32_EPCA_A_STATUS_C5IOVFI_SET_U32 \
   (SI32_EPCA_A_STATUS_C5IOVFI_SET_VALUE << SI32_EPCA_A_STATUS_C5IOVFI_SHIFT)



struct SI32_EPCA_A_COUNTER_Struct
{
   union
   {
      struct
      {
         // Counter/Timer
         volatile uint16_t COUNTER_BITS;
                  uint32_t reserved0: 16;
      };
      volatile uint32_t U32;
   };
};

