jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_EPCA_A_Registers.h
#define SI32_EPCA_A_COUNTER_COUNTER_MASK  0x0000FFFF
#define SI32_EPCA_A_COUNTER_COUNTER_SHIFT  0



struct SI32_EPCA_A_LIMIT_Struct
{
   union
   {
      struct
      {
         // Upper Limit
         volatile uint16_t LIMIT_BITS;
                  uint32_t reserved0: 16;
      };
      volatile uint32_t U32;
   };
};

#define SI32_EPCA_A_LIMIT_LIMIT_MASK  0x0000FFFF
#define SI32_EPCA_A_LIMIT_LIMIT_SHIFT  0



struct SI32_EPCA_A_LIMITUPD_Struct
{
   union
   {
      struct
      {
         // Module Upper Limit Update Value
         volatile uint16_t LIMITUPD_BITS;
                  uint32_t reserved0: 16;
      };
      volatile uint32_t U32;
   };
};

#define SI32_EPCA_A_LIMITUPD_LIMITUPD_MASK  0x0000FFFF
#define SI32_EPCA_A_LIMITUPD_LIMITUPD_SHIFT  0



struct SI32_EPCA_A_DTIME_Struct
{
   union
   {
      struct
      {
         // X Phase Delay Time
         volatile uint8_t DTIMEX;
         // Y Phase Delay Time
         volatile uint8_t DTIMEY;
                  uint32_t reserved0: 16;
      };
      volatile uint32_t U32;
   };
};

#define SI32_EPCA_A_DTIME_DTIMEX_MASK  0x000000FF
#define SI32_EPCA_A_DTIME_DTIMEX_SHIFT  0

#define SI32_EPCA_A_DTIME_DTIMEY_MASK  0x0000FF00
#define SI32_EPCA_A_DTIME_DTIMEY_SHIFT  8



struct SI32_EPCA_A_DTARGET_Struct
{
   union
   {
      struct
      {
         // DMA Transfer Target
         volatile uint32_t DTARGET_BITS;
      };
      volatile uint32_t U32;
   };
};

#define SI32_EPCA_A_DTARGET_DTARGET_MASK  0xFFFFFFFF
#define SI32_EPCA_A_DTARGET_DTARGET_SHIFT  0



typedef struct SI32_EPCA_A_Struct
{
   struct SI32_EPCA_A_MODE_Struct                  MODE           ; // Base Address + 0x0
   uint32_t                                        reserved0;
   uint32_t                                        reserved1;
   uint32_t                                        reserved2;
   struct SI32_EPCA_A_CONTROL_Struct               CONTROL        ; // Base Address + 0x10
   volatile uint32_t                               CONTROL_SET;
   volatile uint32_t                               CONTROL_CLR;
   uint32_t                                        reserved3;
   struct SI32_EPCA_A_STATUS_Struct                STATUS         ; // Base Address + 0x20
   volatile uint32_t                               STATUS_SET;
   volatile uint32_t                               STATUS_CLR;
   uint32_t                                        reserved4;
   struct SI32_EPCA_A_COUNTER_Struct               COUNTER        ; // Base Address + 0x30
   uint32_t                                        reserved5;
   uint32_t                                        reserved6;
   uint32_t                                        reserved7;
   struct SI32_EPCA_A_LIMIT_Struct                 LIMIT          ; // Base Address + 0x40
   uint32_t                                        reserved8;
   uint32_t                                        reserved9;
   uint32_t                                        reserved10;
   struct SI32_EPCA_A_LIMITUPD_Struct              LIMITUPD       ; // Base Address + 0x50
   uint32_t                                        reserved11;
   uint32_t                                        reserved12;
   uint32_t                                        reserved13;
   struct SI32_EPCA_A_DTIME_Struct                 DTIME          ; // Base Address + 0x60
   uint32_t                                        reserved14;
   uint32_t                                        reserved15;
   uint32_t                                        reserved16;
   uint32_t                                        reserved17[4];
   struct SI32_EPCA_A_DTARGET_Struct               DTARGET        ; // Base Address + 0x80
   uint32_t                                        reserved18;
   uint32_t                                        reserved19;
   uint32_t                                        reserved20;
} SI32_EPCA_A_Type;

#ifdef __cplusplus
}
#endif

#endif // __SI32_EPCA_A_REGISTERS_H__

//-eof--------------------------------------------------------------------------

